Revit 2024 API
IFCProductWrapper Methods
The IFCProductWrapper type exposes the following members.
Methods
Name | Description
AddAnnotation
 Adds an annotation handle to associate with the IfcProduct in this wrapper.
AddBuilding
 Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.
AddElement
 Adds an IfcElement handle to associate with the IfcProduct in this wrapper.
AddFinishMaterial
 Adds a material handle to associate with the IfcProduct in this wrapper.
AddSite
 Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.
AddSpace
 Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.
ClearFinishMaterials
 Clear finish materials in this wrapper.
Create(IFCProductWrapper)
 Establishes a new product manager for elements and objects derived from a parent product manager.
Create(ExporterIFC, Boolean)
 Establishes a new baseline product manager for elements and objects.
Create(IFCProductWrapper, Boolean)
 Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindExtrusionCreationParameters
 Obtains the extrusion creation data associated with the given element.
GetAllObjects
 Gets all objects associated with the IfcProduct in this wrapper.
GetAnElement
 Gets the first element handle added to this wrapper.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace